       IDENTIFICATION DIVISION.
       PROGRAM-ID. STATISTICS.

       DATA DIVISION.
       WORKING-STORAGE SECTION.

       01  I                   PIC 9.
       01  VALUE1-STR          PIC X(10).
       01  VALUE2-STR          PIC X(10).
       01  VALUE3-STR          PIC X(10).
       01  DATA-ARR.
           05  VALUE1          PIC S999999V999999.
           05  VALUE2          PIC S999999V999999.
           05  VALUE3          PIC S999999V999999.
       01  MEAN                PIC S999999V999999 VALUE 0.
       01  VARIANCE            PIC S999999V999999 VALUE 0.
       01  RANGE               PIC S999999V999999 VALUE 0.
       01  TEMP-MAX            PIC S999999V999999.
       01  TEMP-MIN            PIC S999999V999999.
       01  TEMP-SUM            PIC S999999V999999 VALUE 0.
       01  TEMP-DIFF           PIC S999999V999999.
       01  TEMP-DIFF-SQ        PIC S999999V999999.
       01  TEMP-VAR-SUM        PIC S999999V999999 VALUE 0.
       01  RANGE-DISPLAY       PIC ZZZZ9.9999.
       01  MEAN-DISPLAY        PIC ZZZZ9.9999.
       01  VARIANCE-DISPLAY    PIC ZZZZ9.9999.

       PROCEDURE DIVISION.
       MAIN-SECTION.

           PERFORM READ-DATA
           PERFORM FIND-RANGE
           PERFORM FIND-MEAN
           PERFORM FIND-VARIANCE

           MOVE RANGE TO RANGE-DISPLAY
           MOVE MEAN TO MEAN-DISPLAY
           MOVE VARIANCE TO VARIANCE-DISPLAY

           DISPLAY "Range: " RANGE 
           DISPLAY "Mean: " MEAN 
           DISPLAY "Variance: " VARIANCE

           STOP RUN.

       READ-DATA.
           DISPLAY "Enter value 1:"
           ACCEPT VALUE1-STR
           MOVE FUNCTION NUMVAL (VALUE1-STR) TO VALUE1

           DISPLAY "Enter value 2:"
           ACCEPT VALUE2-STR
           MOVE FUNCTION NUMVAL (VALUE2-STR) TO VALUE2

           DISPLAY "Enter value 3:"
           ACCEPT VALUE3-STR
           MOVE FUNCTION NUMVAL (VALUE3-STR) TO VALUE3.

       FIND-RANGE.
           MOVE VALUE1 TO TEMP-MAX
           MOVE VALUE1 TO TEMP-MIN

           IF VALUE2 > TEMP-MAX
               MOVE VALUE2 TO TEMP-MAX
           END-IF
           IF VALUE3 > TEMP-MAX
               MOVE VALUE3 TO TEMP-MAX
           END-IF

           IF VALUE2 < TEMP-MIN
               MOVE VALUE2 TO TEMP-MIN
           END-IF
           IF VALUE3 < TEMP-MIN
               MOVE VALUE3 TO TEMP-MIN
           END-IF

           COMPUTE RANGE = TEMP-MAX - TEMP-MIN.

       FIND-MEAN.
           COMPUTE TEMP-SUM = VALUE1 + VALUE2 + VALUE3
           COMPUTE MEAN = TEMP-SUM / 3.

       FIND-VARIANCE.
           MOVE 0.0 TO TEMP-VAR-SUM
          
           COMPUTE TEMP-DIFF = VALUE1 - MEAN
           COMPUTE TEMP-DIFF-SQ = TEMP-DIFF * TEMP-DIFF
           ADD TEMP-DIFF-SQ TO TEMP-VAR-SUM

           COMPUTE TEMP-DIFF = VALUE2 - MEAN
           COMPUTE TEMP-DIFF-SQ = TEMP-DIFF * TEMP-DIFF
           ADD TEMP-DIFF-SQ TO TEMP-VAR-SUM

           COMPUTE TEMP-DIFF = VALUE3 - MEAN
           COMPUTE TEMP-DIFF-SQ = TEMP-DIFF * TEMP-DIFF
           ADD TEMP-DIFF-SQ TO TEMP-VAR-SUM

           COMPUTE VARIANCE = TEMP-VAR-SUM / 0002.000.


